Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courtroom/index.html.txt.tmx
Source language: en
Languages: ga

source: Functions and duties of individuals in a court of law
ga: Feidhmeanna agus dualgais éagsúla i gcúirt dlí

source: This document provides an introduction to the section outlining the different functions and duties of individuals in a court of law
ga: Réamhrá is ea é an doiciméad seo don mír a leagann amach na feidhmeanna agus na dualgais éagsúla atá ag daoine i gcuirt dlí

source: Judges in a court of law are appointed by the President. Who can be appointed as a judge and what is their role?
ga: Cuireann an doiciméad seo síos ar ról agus feidhm breithimh i gcúirt dlí in Éirinn

source: Role of the tipstaff
ga: Ról an ghiolla cúirte

source: This document describes the role of the tipstaff in a court of law
ga: Cuireann an doiciméad seo síos ar ról an ghiolla cúirte i gcúirt dlí

source: Court Registrars in Ireland are public servants. Find out about the role and function of Court Registrars
ga: Pléann an doiciméad seo ról agus feidhm an Chláraitheora Chúirte i gcúirt dlí

source: Role and function of a barrister in a court of law
ga: Pléann an doiciméad seo ról agus feidhm abhcóide i gcúirt dlí

source: Junior and senior counsel
ga: Abhcóidí sóisir agus sinsir

source: This document describes the roles and functions of junior and senior counsel in a court of law
ga: Cuireann an doiciméad seo síos ar ról agus feidhm abhcóidí shóisir agus shinsir i gcúirt dlí

source: Overview of the role and function of solicitors in a court of law
ga: Pléann an doiciméad seo ról agus feidhm aturnaetha i gcúirt dlí

source: The jury fulfils a very important role in the legal system in Ireland. Who are the jury and why is a jury not required in every case?
ga: Cuireann an doiciméad seo síos ar ról agus feidhm giúiré i gcúirt dlí in Éirinn

source: What is jury service?
ga: Cad is seirbhís ghiúiréann?

source: Find out how members of juries in Ireland are selected, contacted and your employment rights
ga: Faigh eolas ar conas a roghnaítear baill ghiúiré in Éirinn, conas a dhéantar teagmháil leo agus ar do chearta fostaíochta

source: The role of witnesses
ga: An ról atá ag finnéithe

source: A witness in Ireland is someone who has been called to give evidence in a court of law. What is the role of a witness in a case?
ga: Cuireann an doiciméad seo síos ar ról agus feidhm finnéithe i gcúirt dlí in Éirinn

source: Court stenographers keep verbatim records of proceedings in a court of law. Why are these records retained?
ga: Cuireann an doiciméad seo síos ar ról agus feidhm an luathscríbhneora cúirte i gcúirt dlí

source: This document discusses the role and function of court reporters in a court of law
ga: Cuireann an doiciméad seo síos ar ról agus feidhm tuairisceoirí cúirte i gcúirt dlí

source: Most Read in "Justice"
ga: Ábhar is mó éilimh i "Dlí"

source: Alcohol and the law
ga: Alcól agus an dlí
